stress-test.yml
config:
  target: "http://localhost:5005"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
    - duration: 60
      arrivalRate: 50
      rampTo: 100
    - duration: 60
      arrivalRate: 100
      rampTo: 200
  payload:
    path: "users.csv"
    fields:
      - "userId"
      - "qrCodeData"
      - "userLat"
      - "userLon"
    delimiter: ";"
    skipHeader: true
    order: sequence

scenarios:
  - flow:
      - post:
          url: "/scan-qr/double-qr"
          json:
            userId: "{{ userId }}"
            qrCodeData: "{{ qrCodeData }}"
            userLat: "{{ userLat }}"
            userLon: "{{ userLon }}"